from config.tokens import channel_username, bot_username,how_many_ref,ref_reward

greeting = """
👋 سلام دوست عزیز! خیلی خوش آمدید! 👋

شما می‌توانید در هر زمان، لینک ویدیویی که می‌خواهید دانلود کنید، ارسال کنید.
"""

restart_required = "⭕ لطفا با دستور /start ربات را مجددا راه‌اندازی کنید."

unknown_request = "ببخشید، من درخواست شما را متوجه نشدم. 🧐"

guide = f"""
😁 دانلود از طریق ربات ما خیلی آسونه...

💫 *آموزش دانلود از یوتیوب:*
➖ برای دانلود از طریق ربات ما فقط کافیه
• بری داخل یوتیوب
• لینک ویدیو رو کپی کن (چه آدرس وب و چه ادرس خود ویدیو).
• لینکو هر زمانی که دلت خواست برای ربات بفرست تا برات دانلود کنه.
• و تمام به همین سادگی 😄

🔱 مثال هایی از لینک های یوتیوبی:
- https://youtu.be/
- https://www.youtube.com/watch/
- https://www.youtube.com/shorts/
- https://youtube.com/shorts/

➕ علاوه بر آدرس https://www ربات نیز از آدرس http://www پشتیبانی میکنه !

❓ اگر بازم سوال داشتی میتونی از طریق پشتیبانی بهمون پیام بدی !

➖➖➖➖➖➖
🌐 {channel_username}
🤖 {bot_username}
"""

select_download_option = "❓لطفا کیفیت را انتخاب کنید:"

server_error = "❌خطایی از سمت سرور رخ داده است! لطفاً دوباره امتحان کنید."

getting_media_link_information = "🔍درحال دریافت اطلاعات لینک..."

age_restricted_exception = "متأسفیم، محتوایی که می‌خواهید دانلود کنید دارای محدودیت سنی توسط یوتیوب است، بنابراین ما قادر به دانلود آن نیستیم. ☹️"

subscribe_to_channel = """✨ برای استفاده از ربات، لطفاً ابتدا با فشردن دکمه زیر در کانال ما عضو شوید.

🚀 پس از عضویت، لطفاً دکمه "عضو شدم" را فشار دهید."""

returned_to_homepage = "شما به صفحه اصلی برگشتید. 🏡"

send_the_giftcode = "🛎️ لطفا کد هدیه را ارسال کنید"

reciving_message_from_support = "👥 پیام از پشتیبانی:"

your_message_was_sent_to_support = "✅ پیام شما به پشتیبانی ارسال شد. در اسرع وقت با شما ارتباط برقرار خواهد شد."

youre_connected_to_support = """
شما اکنون به بخش پشتیبانی متصل هستید، لطفا پیام خود را ارسال کنید.
🙏 حجم پیام ها بالاست لطفا برای پاسخ صبور باشید.
"""

account_details = ("""
👥 شناسه کاربری: `{}`
🌍 زبان: فارسی 🇮🇷
📅 تاریخ عضویت: {}

📥 تعداد کل دانلودها: {}
💾 حجم کل دانلودها: {} مگابایت

💰 موجودی: {} تومان
🤝 تعداد زیر مجموعه ها: {}
💲 سود شما از زیر مجموعه ها: {} تومان

🚀 برای شارژ حساب کاربری خود از زیر مجموعه گیری اقدام کنید. برای زیر مجموعه گیری از دکمه '*'زیر مجموعه گیری'*' استفاده کنید!

➖➖➖➖➖➖
""") + f"{bot_username}"

my_subscribtion_details = ("""
🔸 نوع اشتراک : *{}*
⏰ مدت زمان اشتراک : *{}* روز
⌛ روز های باقی مانده : *{}* روز

📏 حداکثر حجم برای هر فایل : *{}* مگابایت
📆 حداکثر حجم در روز : *{}* مگابایت
💾 حجم استفاده شده : *{}* مگابایت
💼 حجم باقی‌مانده : *{}* مگابایت

📔 هر *1* گیگ برار با *1000* مگابایت است.

⏱️ حجم های اشتراک بصورت روزانه ریستارت میشوند و مقدار مصرفی اشتراک شما دوباره از صفر شروع میشود.

➖➖➖➖➖➖
""") + f"{bot_username}"

redeem_successful = """🎇 کد هدیه با موفقیت اعمال شد.
💰 موجودی جدید شما *{}* تومان است.
"""
code_already_redeemed = "☹️ این کد هدیه قبلاً استفاده شده است."

invalid_giftcode = """
❌ کد هدیه اشتباه و یا معتبر نیست.
✏️ لطفا کد هدیه را با دقت وارد کنید و به حروف کوچک و بزرگ توجه کنید.
"""

invite_referral_banner = """🌟 سلام! تاحالا شده بخوای ویدیو از یوتیوب دانلود کنی اما اشتراک پرمیوم یوتیوب نداری؟
نمیخوای ویدیو هاتو تو گالریت ذخیره کنی ولی می‌خوای به صورت دائمی به اونا دسترسی داشته باشی؟
یک ربات عالی برات دارم!
میتوتی از طریق ربات زیر تمام اونکارارو انجام بدی !
فقط کافیه به ربات زیر برید و دکمه شروع رو فشار بدید! 🚀

🤖 {}"""

invite_referral_guide = f"""☝️ با اشتراک گذاری بنر بالا، میتوانید زیرمجوعه گیری کنید!😁

با دعوت کردن {how_many_ref} نفر از دوستان خود، {ref_reward} هزار تومان شارژ حساب میگیرید! 😯

همین حالا دوستاتونو دعوت کنید! 🎉
"""

no_video_options = "❌هیچ روش دانلودی برای این لینک یافت نشد."

cant_download_larger_than_50mb = "متاسفانه در حال حاضر نمیتوانید فایل های بزرگتر از 50 مگابایت دانلود کنید"

connection_error = "❌خطا در ارتباط با سرور"

caption = """
🎈 عنوان: *{}*
📽️ کیفیت: *{}*
👀 بازدید: *{}*

🔗 توضیحات: {}

📅 تاریخ انتشار: *{}*
➖➖➖➖➖➖
🤖 """ + f"{bot_username}"

file_data_exceeded = "🚫حجم فایل از حد مجاز بیشتر است!"

daily_limit_exceeded = "🚫حداکثر حجم روزانه شما کمتر از حجم فایل است!"

cant_download_1080p = "❌ متاسفانه کیفیت 1080p نمیتوانید دانلود کنید, برای دانلود با این کیفیت لطفا از قسمت خرید اشتراک، اشتراک ویژه تهیه کنید."
cant_download_1080p_rn = "❌ متاسفانه در حال حاضر دانلود با کیفیت 1080p غیرفعال میباشد."

processing_message = "✨درحال پردازش..."

not_subscribed_to_channel = "❌شما در کانال ما عضو نیستید!"

coming_soon = "⚡️بزودی..."

subscriptions_list = """
✳️ لیست اشتراک ها :

💥 با خرید اشتراک ویژه میتونی از تمام قابلیت های ربات استفاده کنی !
➕ برخی از ویژگی های اشتراک ویژه : حجم دانلود بیشتر، بدون تبلغات، کیفیت دانلود بالاتر و...
فقط کافیه رو اشتراک مورد علاقت کلیک کنی 😁
➖ اشتراک هایی که دارای ایموجی 🔥 هستند، تخفیف خوردند !
➖➖➖➖➖➖
🤖 """ + f"{bot_username}"

subscription_details = """
🛍️ نوع : پریمیوم
⏳ مدت زمان اشتراک : *{}* روز
🔽 حداکثر حجم دانلود روزانه : *{}* گیگ
⏬ حداکثر حجم هر فایل : *{}* گیگ

📔 هر *1* گیگ برار با *1000* مگابایت است.

🌟 ویژگی های خاص این اشتراک :
- دانلود با کیفیت 1080p و بالاتر !
- بدون تبلغات !

💸 قیمت : *{}* تومان
🔥 تخفیف : *{}*% (*{}* تومان)
🔰 شارژ حساب شما : *{}* تومان
💲 مبلغ قابل پرداخت : *{}* تومان

❗ توجه کنید درصورتی که موجودی حساب شما با مبلغ یکی و یا بیشتر باشد، مبلغ اشتراک از حساب شما کسر خواهد شد و نیازی به پرداخت آنلاین نخواهد بود.
➖➖➖➖➖➖
🤖 """ + f"{bot_username}"

insufficient_balance = """
❌ موجودی شما برای خرید این اشتراک کافی نیست. لطفا حساب خود را شارژ کنید و مجددا اقدام به خرید کنید.

⚜️ برای شارژ حساب خود میتوانید در بخش *👤 حساب کاربری*، زیر مجموعه گیری کنید ، و یا از دکمه زیر استفاده کنید.
➖➖➖➖➖➖
🤖 """ + f"{bot_username}"

subscription_bought = """
✅ شما با موفقیت اشتراک *{}* به قیمت *{}* تومان خریدید.

🎉 الان میتونی از تمامیه قابلیت های ربات استفاده کنی!
"""

subscription_already_bought = """
❌ شما قبلاً اشتراک *{}* خرید کرده اید.

♻️ به همین خاطر درحال حاضر نمیتوانید این اشتراک را مجددا خریداری کنید، برای خرید مجدد این اشتراک باید صبر کنید تا اشتراک فعلی شما منقضی شود.
"""

stats = """
📊 تعداد کاربران:
┐ امروز: *{}* کاربر
┤ دیروز: *{}* کاربر
┤ این هفته: *{}* کاربر
┤ این ماه: *{}* کاربر
┘ کل: *{}* کاربر
➖➖➖➖➖➖➖➖
🤖 """ + f"{bot_username}"

your_balance_changed_by_admin = """
‼️اعتبار حساب شما توسط مدیر تغییر یافت!

💰 موجودی قبلی: *{}* تومان
💵 موجودی جدید: *{}* تومان

📨 پیام: *{}*
➖➖➖➖➖➖➖➖
🤖 """ + f"{bot_username}"
get_user_stat_message = """
👥 اطلاعات کاربر

👤 نام کاربری: @{}
💳 شناسه کاربری: `{}`
📆 تاریخ عضویت: *{}*

📥 تعداد کل دانلودها: *{}*
💾 حجم کل دانلودها: *{}* مگابایت

💰 موجودی: *{}* تومان
🤝 تعداد زیر مجموعه ها: *{}* نفر
💲 سود از زیر مجموعه ها: *{}* تومان

🔸 نوع اشتراک: *{}*
⏰ مدت زمان اشتراک: *{}*
⌛️ روز های باقی مانده: *{}*
➖➖➖➖➖➖➖➖
🤖 """ + f"{bot_username}"

send_message_to_user_template = "👨‍💼 یک پیام از مدیریت :\n *{}*"

admin_commands_help = """
📇 دستورات مدیریتی :
➖➖➖➖➖➖➖➖
/send_message_to_all [Text] - .ارسال پیام به همه کاربران
/send_message_to_free_users [Text] - .ارسال پیام به کاربران رایگان
/send_message_to_premium_users [Text] - .ارسال پیام به کاربران پرمیوم
/send_message_to_user [User_id] [Text] - .ارسال پیام به کاربر
/stat - .مشاهده آمار ربات
/user_stat [User_id] - .مشاهده آمار کاربر
/include_balance [User_id] [Credit] - .تغییر موجودی کاربر
/generate_giftcode [Credit] - .ساخت یک گیفت کد
"""

video_not_available = "این ویدیو در دسترس نیست."
